// Вывести квадрат числа

Console.Write("Введите число ->");

String? numberStr = Console.ReadLine();

int number = int.Parse(numberStr);

Console.WriteLine($"Квадрат числа:{number*number}");
